# Table of Contents 

- [Libraries and Data](#Section1)
- [Feature Selection](#Section2)
- [Understand the Features](#Section3)

<a id='Section1'></a>
## Libraries and Data

In [1]:
import pandas as pd 
import numpy as np 

import warnings
warnings.filterwarnings('ignore')

import matplotlib.pyplot as plt 
import seaborn as sns

In [2]:
train = pd.read_csv('../Data/titanic/train.csv')
test = pd.read_csv('../Data/titanic/test.csv')

In [3]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

### Missing Values

In [4]:
train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
train[train.isna().any(axis=1)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

<a id='Section2'></a>
## Feature Selection

### Pclass

In [6]:
train[['Pclass', 'Survived']].groupby(['Pclass'], as_index = False).mean()

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363

### Sex

In [7]:
train[['Sex', 'Survived']].groupby(['Sex'], as_index = False).mean()

      Sex  Survived
0  female  0.742038
1    male  0.188908

### Family Size

In [8]:
full_data = [train, test] # This is a list. Putting DFs in list doesnt copy it. Any changes to the list will be reflected in DFs
#https://stackoverflow.com/questions/57399886/list-of-two-dataframes-if-i-change-elements-of-list-dataframes-will-the-data

In [9]:
type(full_data)

list

In [10]:
len(full_data)

2

In [11]:
for dataset in full_data:
    dataset['FamilySize'] = dataset['SibSp'] + dataset['Parch'] + 1

In [12]:
train[['FamilySize', 'Survived']].groupby(['FamilySize'], as_index = False).mean()

   FamilySize  Survived
0           1  0.303538
1           2  0.552795
2           3  0.578431
3           4  0.724138
4           5  0.200000
5           6  0.136364
6           7  0.333333
7           8  0.000000
8          11  0.000000

### Alone and Not Alone

In [13]:
for dataset in full_data:
    dataset['IsAlone'] = 0
    dataset.loc[dataset['FamilySize'] == 1, 'IsAlone'] = 1
print (train[['IsAlone', 'Survived']].groupby(['IsAlone'], as_index=False).mean())

   IsAlone  Survived
0        0  0.505650
1        1  0.303538

### Embarked

In [16]:
for dataset in full_data:
    dataset['Embarked'] = dataset['Embarked'].fillna('S')
print (train[['Embarked', 'Survived']].groupby(['Embarked'], as_index=False).mean())

  Embarked  Survived
0        C  0.553571
1        Q  0.389610
2        S  0.339009

### Fare

<a id='Section3'></a>
## Understand the Features/Inputs